In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

### Read in the public art data and examine the shape, head, and tail

In [2]:
art = pd.read_csv('../data/public_art.csv')
art.head(2)

,Title,Last Name,First Name,Location,Medium,Type,Description,Latitude,Longitude,Mapped Location
0,[Cross Country Runners],Frost,Miley,"4001 Harding Rd., Nashville TN",Bronze,Sculpture,NaN,36.12856,-86.83660,"(36.12856, -86.8366)"
1,[Fourth and Commerce Sculpture],Walker,Lin,"333 Commerce Street, Nashville TN",NaN,Sculpture,NaN,36.16234,-86.77774,"(36.16234, -86.77774)"

In [3]:
art.tail(2)

,Title,Last Name,First Name,Location,Medium,Type,Description,Latitude,Longitude,Mapped Location
130,Women Suffrage Memorial,LeQuire,Alan,"600 Charlotte Avenue, Nashville TN",Bronze sculpture,Sculpture,NaN,36.16527,-86.78382,"(36.16527, -86.78382)"
131,Youth Opportunity Center-STARS Nashville - Pea...,Rudloff,Andee,1704 Charlotte Ave.,House paint on vinyl,Mural,NaN,36.15896,-86.79900,"(36.15896, -86.799)"

In [4]:
art.shape

(132, 10)

### Let's explore these pandas methods, attributes, and accessors
 * .shape
 - .head()
 * .tail()
 - .columns
 - .drop()
 - .rename()
 - .query()
 - .loc[]
 - .iloc[]
 - [[]]

In [5]:
art.columns

Index(['Title', 'Last Name', 'First Name', 'Location', 'Medium', 'Type',
       'Description', 'Latitude', 'Longitude', 'Mapped Location'],
      dtype='object')

In [6]:
sculptures = art.query('Type == "Sculpture"')
sculptures.shape

(61, 10)

In [7]:
my_list = ['Sculpture', 'Mural']
sculptures_and_murals = art.query("Type in @my_list")
sculptures_and_murals.shape

(99, 10)

In [8]:
#art.loc[art.Type == 'Sculpture']
first_five = art.iloc[0:5, 1:3]

In [9]:
first_five

                                  Last Name                 First Name
0                                     Frost                      Miley
1                                    Walker                        Lin
2                                   Kennedy                        Kim
3  Stevenson and Stanley and ROFF (Harroff)  Doug and Ronnica and Lynn
4                                    Ridley                       Greg

In [10]:
artists = art[['Last Name', 'First Name']]
artists.head(2)

  Last Name First Name
0     Frost      Miley
1    Walker        Lin

In [11]:
art = art.drop(columns = ['Mapped Location'])

In [12]:
art.columns

Index(['Title', 'Last Name', 'First Name', 'Location', 'Medium', 'Type',
       'Description', 'Latitude', 'Longitude'],
      dtype='object')

In [13]:
art.columns = ['title', 'last', 'first', 'loc', 'med',
              'type', 'desc', 'lat', 'lng']

In [14]:
art = art.rename(columns = {'Title': 'title', 'Last Name': 'last_name', 'First Name': 'first_name',
           'Location': 'loc', 'Medium': 'medium',  
            'Desccription': 'desc', 'Latiitude': 'lat', 'Longitude': 'lng'})